onandoffables/avrpi-tools/install/arduino-linuxgpio/patches/boards.txt
##############################################################

avrpi8.name=AVRPI328 ATmega328p @ 8MHz

avrpi8.upload.using=linuxgpio
avrpi8.upload.protocol=linuxgpio
avrpi8.upload.maximum_size=32768
avrpi8.upload.speed=57600
avrpi8.upload.disable_flushing=true

avrpi8.bootloader.low_fuses=0xE7
avrpi8.bootloader.high_fuses=0xDA
avrpi8.bootloader.extended_fuses=0x07
avrpi8.bootloader.path=atmega
avrpi8.bootloader.file=ATmegaBOOT_168_atmega328.hex
avrpi8.bootloader.unlock_bits=0x3F
avrpi8.bootloader.lock_bits=0x0F

avrpi8.build.mcu=atmega328p
avrpi8.build.f_cpu=8000000L
avrpi8.build.core=arduino
avrpi8.build.variant=standard

##############################################################

avrpi12.name=AVRPI328 ATmega328p @ 12MHz

avrpi12.upload.using=linuxgpio
avrpi12.upload.protocol=linuxgpio
avrpi12.upload.maximum_size=32768
avrpi12.upload.speed=57600
avrpi12.upload.disable_flushing=true

avrpi12.bootloader.low_fuses=0xE7
avrpi12.bootloader.high_fuses=0xDA
avrpi12.bootloader.extended_fuses=0x07
avrpi12.bootloader.path=atmega
avrpi12.bootloader.file=ATmegaBOOT_168_atmega328.hex
avrpi12.bootloader.unlock_bits=0x3F
avrpi12.bootloader.lock_bits=0x0F

avrpi12.build.mcu=atmega328p
avrpi12.build.f_cpu=12000000L
avrpi12.build.core=arduino
avrpi12.build.variant=standard

##############################################################

avrpi16.name=AVRPI328 ATmega328p @ 16MHz

avrpi16.upload.using=linuxgpio
avrpi16.upload.protocol=linuxgpio
avrpi16.upload.maximum_size=32768
avrpi16.upload.speed=57600
avrpi16.upload.disable_flushing=true

avrpi16.bootloader.low_fuses=0xE7
avrpi16.bootloader.high_fuses=0xDA
avrpi16.bootloader.extended_fuses=0x07
avrpi16.bootloader.path=atmega
avrpi16.bootloader.file=ATmegaBOOT_168_atmega328.hex
avrpi16.bootloader.unlock_bits=0x3F
avrpi16.bootloader.lock_bits=0x0F

avrpi16.build.mcu=atmega328p
avrpi16.build.f_cpu=16000000L
avrpi16.build.core=arduino
avrpi16.build.variant=standard

##############################################################

avrpi32u4.name=AVRPI32U4 ATmega32U4 @ 8MHz

avrpi32u4.upload.using=linuxgpio
avrpi32u4.upload.protocol=linuxgpio
avrpi32u4.upload.maximum_size=32768
avrpi32u4.upload.speed=57600
avrpi32u4.upload.disable_flushing=true

avrpi32u4.bootloader.low_fuses=0xff
avrpi32u4.bootloader.high_fuses=0xd8
avrpi32u4.bootloader.extended_fuses=0xcb
avrpi32u4.bootloader.path=caterina
avrpi32u4.bootloader.file=Caterina-Leonardo.hex
avrpi32u4.bootloader.unlock_bits=0x3F
avrpi32u4.bootloader.lock_bits=0x2F

avrpi32u4.build.mcu=atmega32u4
avrpi32u4.build.f_cpu=8000000L
avrpi32u4.build.vid=0x2341
avrpi32u4.build.pid=0x8036
avrpi32u4.build.core=arduino:arduino
avrpi32u4.build.variant=leonardo

##############################################################

gert328.name=Gertboard with ATmega328 (GPIO)

gert328.upload.using=linuxgpio
gert328.upload.protocol=linuxgpio
gert328.upload.maximum_size=32768
gert328.upload.speed=57600
gert328.upload.disable_flushing=true

gert328.bootloader.low_fuses=0xE7
gert328.bootloader.high_fuses=0xDA
gert328.bootloader.extended_fuses=0x07
gert328.bootloader.path=atmega
gert328.bootloader.file=ATmegaBOOT_168_gert328.hex
gert328.bootloader.unlock_bits=0x3F
gert328.bootloader.lock_bits=0x0F

gert328.build.mcu=atmega328p
gert328.build.f_cpu=12000000L
gert328.build.core=arduino
gert328.build.variant=standard


##############################################################

gert168.name=Gertboard with ATmega168 (GPIO)

gert168.upload.using=linuxgpio
gert168.upload.protocol=linuxgpio
gert168.upload.maximum_size=16384
gert168.upload.speed=57600
gert168.upload.disable_flushing=true

gert168.bootloader.low_fuses=0xE7
gert168.bootloader.high_fuses=0xDA
gert168.bootloader.extended_fuses=0x07
gert168.bootloader.path=atmega
gert168.bootloader.file=ATmegaBOOT_168_gert168.hex
gert168.bootloader.unlock_bits=0x3F
gert168.bootloader.lock_bits=0x0F

gert168.build.mcu=atmega168
gert168.build.f_cpu=12000000L
gert168.build.core=arduino
gert168.build.variant=standard

##############################################################

gertduino48.name=Gertduino ATmega44 (GPIO)

gertduino48.upload.using=linuxgpio
gertduino48.upload.protocol=linuxgpio
gertduino48.upload.maximum_size=4096
gertduino48.upload.speed=57600
gertduino48.upload.disable_flushing=true

gertduino48.bootloader.low_fuses=0xE2
gertduino48.bootloader.high_fuses=0xDF
gertduino48.bootloader.extended_fuses=0x01
gertduino48.bootloader.path=atmega
gertduino48.bootloader.file=ATmegaBOOT_48_gert48.hex
gertduino48.bootloader.unlock_bits=0x3F
gertduino48.bootloader.lock_bits=0x0F

gertduino48.build.mcu=atmega48p
gertduino48.build.f_cpu=8000000L
gertduino48.build.core=arduino
gertduino48.build.variant=standard


##############################################################

gertduino328.name=Gertduino with ATmega328 (GPIO)

gertduino328.upload.using=linuxgpio
gertduino328.upload.protocol=linuxgpio
gertduino328.upload.maximum_size=32768
gertduino328.upload.speed=57600
gertduino328.upload.disable_flushing=true

gertduino328.bootloader.low_fuses=0xE7
gertduino328.bootloader.high_fuses=0xDA
gertduino328.bootloader.extended_fuses=0x07
gertduino328.bootloader.path=atmega
gertduino328.bootloader.file=ATmegaBOOT_168_gert328.hex
gertduino328.bootloader.unlock_bits=0x3F
gertduino328.bootloader.lock_bits=0x0F

gertduino328.build.mcu=atmega328p
gertduino328.build.f_cpu=16000000L
gertduino328.build.core=arduino
gertduino328.build.variant=standard


##############################################################

gertduino168.name=Gertduino with ATmega168 (GPIO)

gertduino168.upload.using=linuxgpio
gertduino168.upload.protocol=linuxgpio
gertduino168.upload.maximum_size=16384
gertduino168.upload.speed=57600
gertduino168.upload.disable_flushing=true

gertduino168.bootloader.low_fuses=0xE7
gertduino168.bootloader.high_fuses=0xDA
gertduino168.bootloader.extended_fuses=0x07
gertduino168.bootloader.path=atmega
gertduino168.bootloader.file=ATmegaBOOT_168_gert168.hex
gertduino168.bootloader.unlock_bits=0x3F
gertduino168.bootloader.lock_bits=0x0F

gertduino168.build.mcu=atmega168
gertduino168.build.f_cpu=16000000L
gertduino168.build.core=arduino
gertduino168.build.variant=standard

